Revit 2024 API
FabricationPart.ServiceType Property
 The service type identifier of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public int ServiceType { get; }
Visual Basic
Public ReadOnly Property ServiceType As Integer
	Get
Visual C++
public:
property int ServiceType {
	int get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace